package edu.training.les04_java_core_basic_programs.main;

public class BasicProgram06 {

	public static void main(String[] args) {
		// 6. Написать программу, которая выводит на экран первые четыре степени числа π.
		System.out.println("Первые четыре степени числа π:");
		System.out.println(Math.pow(Math.PI, 1));
		System.out.println(Math.pow(Math.PI, 2));
		System.out.println(Math.pow(Math.PI, 3));
		System.out.println(Math.pow(Math.PI, 4));
		
	}

}
